tutorials/FieldsForMapping/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
12556
(
1.15562
1.15558
1.15553
1.15552
1.15589
1.15591
1.15593
1.15597
...
)
;

boundaryField
{
    topAndBottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
72
(
1.15562
1.15562
1.15486
1.15487
1.15407
1.15411
1.15326
1.15335
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform 1.15625;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
62
(
1.1393
1.13928
1.13992
1.14186
1.15003
1.14662
1.14457
1.14378
...
)
;
    }
    wing
    {
        type            nutkWallFunction;
        value           nonuniform List<scalar> 
378
(
0.000700858
0.000182625
0.000182436
0.000206964
0.000275199
0.000233571
0.000207209
0.000215062
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
